Examinator/src/Catalogs/КаталогМероприятийСУО/КаталогМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогМероприятийСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАудитории</name>
    <type>
      <types>CatalogRef.ТипыАудиторийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольПреподавателя</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождениеЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПовторноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Темы</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.СодержаниеМероприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПриПроведении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПреподаватели</name>
    <attributes>
      <name>РольПреподавателя</name>
      <type>
        <types>CatalogRef.РолиПреподавателейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотрВедомости</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/МестаПроведенияМероприятийСУО/МестаПроведенияМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МестаПроведенияМероприятийСУО</name>
  <enumValues>
    <name>Аудитория</name>
  </enumValues>
  <enumValues>
    <name>Дистанционно</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/КаталогМероприятийСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	УправлениеОбучениемСУО.ЗаполнитьХарактеристики(ЭтотОбъект, Объект.Ссылка);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Объект.Вид)
			И Объект.Вид.ТребуетсяПреподаватель Тогда
			
			Объект.РольПреподавателя = Справочники.РолиПреподавателейСУО.Модератор;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
	УстановитьЗаголовок();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Справочники.ЗаданияСУО);
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ЗаданияПодключаемыеКоманды;
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru = 'Не задана схема мероприятия. Открытие формы отменено'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеОбучениемСУО.ЗаписатьХарактеристики(ЭтотОбъект);
	УстановитьДоступностьЭлементовФормыНаСервере();
	УстановитьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьМероприятия", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВсеТемыПриИзменении(Элемент)
	
	Если Объект.ВсеТемы Тогда
		Объект.Темы.Очистить();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПроведенияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеРесурсыЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Элементы.ЭлектронныеРесурсы.ТекущиеДанные.ЭлектронныйРесурс);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСхемыМероприятий

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СхемыМероприятий

&НаКлиенте
Процедура СхемыМероприятийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСодержание

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Содержание

&НаКлиенте
Процедура СодержаниеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадания

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Задания

&НаКлиенте
Процедура ЗаданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКритерииДостиженияРезультатов

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ КритерииДостиженияРезультатов

&НаКлиенте
Процедура КритерииДостиженияРезультатовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеРесурсы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ  ЭлектронныеРесурсы

&НаКлиенте
Процедура ЭлектронныеРесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	РесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеРесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Поле = Элемент.Имя;
	ТекстСообщения = "";
	ИмяРеквизита = "";
	
	Если НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено Тогда
				
		ТекстСообщения = НСтр("ru = 'Укажите, при каких статусах Проведения обучения показывать ресурс'");
		ИмяРеквизита = "ПоказатьПриСтатусеЗавершено";
		
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно
		И НЕ Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено
		И Элемент.ТекущиеДанные.ПоказатьПослеПрохождения Тогда
		
		ТекстСообщения = НСтр("ru = 'Флажок не может быть установлен, когда ресурс показывается только при статусе Запланировано'");
		ИмяРеквизита = "ПоказатьПослеПрохождения";
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) И ЗначениеЗаполнено(ИмяРеквизита) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,
			Поле + "["+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Элемент.ТекущаяСтрока) +"]." + ИмяРеквизита,
			"Объект");
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ДобавитьХарактеристику(Команда)
	УправлениеОбучениемСУОКлиент.ДобавитьХарактеристику(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьХарактеристику(Команда)
	УправлениеОбучениемСУОКлиент.УдалитьХарактеристику(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристик(Команда)
	ОткрытьФорму("ПланВидовХарактеристик.ХарактеристикиУчебныхОбъектовСУО.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьОбучения(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", Объект.ПродолжительностьВСекундах);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПродолжительностьОбученияПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьОбученияПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		
		Объект.ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Объект.Продолжительность = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(Объект.ПродолжительностьВСекундах);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКИнтернетРесурсу(Команда)
	
	Если ЗначениеЗаполнено(Объект.АдресВИнтернете) Тогда
		ПерейтиПоНавигационнойСсылке(Объект.АдресВИнтернете);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоПреподавателей(Команда)
	
	Если Элементы.НесколькоПреподавателей.Пометка
		И Объект.ДополнительныеПреподаватели.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НесколькоПреподавателейОчисткаСписка", ЭтотОбъект);		
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Очистить список дополнительных преподавателей?'"), РежимДиалогаВопрос.ДаНет, 0);
		
	КонецЕсли;
	
	Элементы.НесколькоПреподавателей.Пометка = ?(Элементы.НесколькоПреподавателей.Пометка, Ложь, Истина);
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоПреподавателейОчисткаСписка(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;

	Объект.ДополнительныеПреподаватели.Очистить();
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьНовыйФайл(Команда)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере()
	
	ЭтоПодчиненное = Справочники.КаталогМероприятийСУО.ЭтоПодчиненное(Объект.Владелец);
	
	
	
	// Вид
	
	МассивПараметровВыбора = Новый Массив();
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Скрыть", Ложь));
	
	Если ЭтоПодчиненное Тогда
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Общее", Ложь));
	КонецЕсли;
	
	Элементы.Вид.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	// Владелец
	
	Если ЗначениеЗаполнено(Объект.Вид) И ЭтоПодчиненное Тогда
		Элементы.Владелец.Видимость = Истина;
	Иначе
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	// Шкала оценки
	
	Если ЗначениеЗаполнено(Объект.Вид) И Объект.Вид.ВыставляетсяОценка Тогда
		Элементы.ШкалаОценки.Видимость = Истина;
	Иначе
		Элементы.ШкалаОценки.Видимость = Ложь;
	КонецЕсли;
		
	// Значимость
	
	Если ЗначениеЗаполнено(Объект.Вид) И ЭтоПодчиненное Тогда
		Элементы.Значимость.Видимость = Истина;
	Иначе
		Элементы.Значимость.Видимость = Ложь;
	КонецЕсли;
	
	// Группа "Проведение"
	
	Если ЗначениеЗаполнено(Объект.Вид) Тогда		
		Элементы.ГруппаПроведение.Видимость = Истина;				
	Иначе		
		Элементы.ГруппаПроведение.Видимость = Ложь;		
	КонецЕсли;
	
	// Место проведения
	
	Если Объект.Вид.Общее Тогда
		Элементы.МестоПроведения.Видимость = Ложь;
	Иначе
		Элементы.МестоПроведения.Видимость = Истина;
	КонецЕсли;
	
	// Тип аудитории
	
	Если НЕ Объект.Вид.Общее И
		Объект.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда
		
		Элементы.ТипАудитории.Видимость = Истина;
	Иначе
		
		Элементы.ТипАудитории.Видимость = Ложь;
		
	КонецЕсли;	
	
	// Роль преподавателя
		
	Если ЗначениеЗаполнено(Объект.Вид) 
		И Объект.Вид.ТребуетсяПреподаватель 
		И ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО") Тогда
		Элементы.ГруппаРолиПреподавателей.Видимость = Истина;
	Иначе
		Элементы.ГруппаРолиПреподавателей.Видимость = Ложь;
	КонецЕсли;
	
	// Адрес в интернет
	
	Если НЕ Объект.Вид.Общее И Объект.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно Тогда
		Элементы.ГруппаАдресВИнтернете.Видимость = Истина;
	Иначе
		Элементы.ГруппаАдресВИнтернете.Видимость = Ложь;
	КонецЕсли;
	
	// Схемы мероприятий
	
	Если ЗначениеЗаполнено(Объект.Вид) И Объект.Вид.Общее Тогда
		Элементы.СтраницаВариантыПроведенияОбучения.Видимость = Истина;
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(СхемыМероприятий, Объект.Ссылка, "Мероприятие");
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(СхемыМероприятий, Ложь, "Предопределенный");
	Иначе
		Элементы.СтраницаВариантыПроведенияОбучения.Видимость = Ложь;
	КонецЕсли;
	
	// Темы
	
	Если ЗначениеЗаполнено(Объект.Вид) И ЭтоПодчиненное Тогда
		
		Элементы.СтраницаТемы.Видимость = Истина;
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.Владелец.Мероприятие));
		Элементы.ТемыТема.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
		Если Объект.ВсеТемы Тогда
			Элементы.Темы.Доступность = Ложь;
		Иначе
			Элементы.Темы.Доступность = Истина;
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаТемы.Видимость = Ложь;
		
	КонецЕсли;
	
	// Содержание
	
	Если ЗначениеЗаполнено(Объект.Вид) И НЕ ЭтоПодчиненное Тогда
		Элементы.СтраницаСодержание.Видимость = Истина;
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Содержание, Объект.Ссылка);
	Иначе
		Элементы.СтраницаСодержание.Видимость = Ложь;
	КонецЕсли;
	
	// Задания
	
	Если ЗначениеЗаполнено(Объект.Вид) И НЕ Объект.Вид.Общее И Объект.Вид.ВыставляетсяОценка Тогда
		
		Элементы.СтраницаЗадания.Видимость = Истина;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Задания, Объект.Ссылка);
		
		Если Объект.Вид.Электронное Тогда
			Элементы.ПоследовательноеПрохождениеЗаданий.Видимость = Истина;
		Иначе
			Элементы.ПоследовательноеПрохождениеЗаданий.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаЗадания.Видимость = Ложь;
		
	КонецЕсли;
				
	// Дополнительные преподаватели
	
	Если Объект.ДополнительныеПреподаватели.Количество() > 0 Тогда
		Элементы.НесколькоПреподавателей.Пометка = Истина;
	КонецЕсли;
	
	Если Элементы.НесколькоПреподавателей.Пометка Тогда
		Элементы.СтраницаДополнительныеПреподаватели.Видимость = Истина;
	Иначе
		Элементы.СтраницаДополнительныеПреподаватели.Видимость = Ложь;
	КонецЕсли;
	
	// Ресурсы
	
	Элементы.ГруппаКниги.Видимость = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикуНаСервере(ВидХарактеристики) Экспорт
	УправлениеОбучениемСУО.ДобавитьХарактеристикуНаСервере(ЭтотОбъект, ВидХарактеристики);
КонецПроцедуры

&НаСервере
Процедура УдалитьХарактеристикуНаСервере(ВыбранныйЭлемент) Экспорт
	УправлениеОбучениемСУО.УдалитьХарактеристикуНаСервере(ЭтотОбъект, ВыбранныйЭлемент);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок() Экспорт
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Вид) Тогда
		
		АвтоЗаголовок = Ложь;
		
		Заголовок = НСтр("ru = '%1 (создание)'");
		
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Вид, "Наименование"));
		
	Иначе
		
		Заголовок = "";
		АвтоЗаголовок = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗапланировано = Ложь;
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеАктивно = Истина;
		Элемент.ТекущиеДанные.ПоказатьПриСтатусеЗавершено = Истина;
	КонецЕсли;		
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
 	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Задания);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
 	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Задания, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
 	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Задания);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти
